app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["body", "somethin exciting about rails"], ["created_at", "2019-09-18 12:05:34.778691"], ["updated_at", "2019-09-18 12:05:34.778691"]]
---
    def create
        @post.comments.create! comments_params